#version: 0.2 - Trained by `huggingface/tokenizers`
c c
C C
( C
c 1
O )
= O)
( =O)
cc c
(C )
c 2
C (=O)
) cc
+ ]
[ N
CC C
c1 cc
[N H
c1 ccc
c (
C (
c 3
2 )
F )
C 1
CC CC
c2 cc
O C
c1cc cc
N C(=O)
)cc 1
CC 1
(=O) N
(C) C
- ]
C O
c1ccc (
[ O
[O -]
n 1
[NH +]
c2 ccc
3 )
(C l
( F)
c1cccc c1
cc ccc
CC O
C(=O) N
2 +]
[NH 2+]
c2cc ccc
( CC
C 2
[O-] )
c n
c1 n
S (=O)
[ n
O =
N )
CC N
(C (=O)
[n H
(C (=O)N
c 4
(Cl )
B r
CC (C)
C (C)
[nH ]
(C)C )
CC (
2 )cc1
c (C
3 +]
[NH 3+]
c3 ccc
c2ccc (
C N
C (C
c (C)
c3 ccccc
CC CCC
C l
C =
S(=O) (=O)
cc (
c2 )
cc 1
c2 n
OC )
c2ccccc 2
O= C(
c1cc (
F )cc
c1ccc (C
CC (=O)N
) N
n 2
CC 2
[N +]
C )
2) c1
[NH3+] )
Br )
CC [NH+]
4 )
c( N
CCC (
c2ccccc 2)
= O
(Cl )cc
(F) (F)
c1 )
c (=O)
c3 cc
C c1ccc(
[N+] (=O)
CC (=O)
c2cc cc
c1cccc (
c1ccc 2
CC 2)
N 1
C( F)
C 3
s 1
c3ccccc 3
C [NH+]
ccc 2
CCC 1
n c(
C c1
S(=O) (=O)N
n c1
O CC
C( O)
C c1cc
CCCC CCCC
N 2
c3ccc (
= C
OC (C)
C c1n
c3 )
c1ccccc1 )
CO C(=O)
c (Cl)
Cl )
C(F) (F)
# N)
c 5
(C(=O) [O-])
(CC )
O C(=O)
1 )
( O)
CC [NH2+]
cc 2
c3ccccc 3)
= C(
CCN (
)cc c1
C [NH2+]
O=C( N
F )cc1
(F)(F) F)
n n
)cc 2
= N
CO c1ccc(
c4 ccccc
C S
CC(C) (C)
CCCC 1
c( F)
2) CC1
c1 cn
CCO C(=O)
CCC N
c2cc (
CCC (C)
CC 3)
n c2
NC(=O) N
C(=O) [O-]
C (C)C
= S
c4 ccc
CC( O)
o 1
CC 3
c s
CCC O
2) C1
[N+](=O) [O-])
CCN (C(=O)
(C (C)
CCC 2
(Cl )cc1
[N+](=O) [O-]
c1ccc2 c(
c n1
C(=O)N 1
CC (C
( N)
[ S
c2 c(
C n1
= [NH+]
C c1ccc
CCCCC 1
O= C(C
n 3
C c1cc(
c2 c1
C c1ccccc1
n cc
(C 2
c2ccc 3
O=C( [O-])
)cc 2)
c1ccc2c( c1)
CC )
c2 cn
c (C(=O)N
[S i
)N 1
c1 2
(CC (=O)N
[nH +]
CCC (C
ccc 3
c3cc cc
CC1 )
C NC(=O)
[NH+] 1
CC =
[Si ]
n (
)cc (
CC (C)C
c1ccc (Cl)cc1
O C1
c2cc cc(
[NH+] 2
CC n1
c4ccccc 4
c2ccc (C
OC 2
(C) cc
CO c1cc
cc cc
c(C) c1
N #
CC NC(=O)
CCC [NH2+]
c1 c(
CC 2)cc1
c1cccc (C
CC S
c2ccc (Cl)cc
C(=O) [O-])
c2ccc( F)cc
=O) cc1
)cc 3)
C 2)
CO c1ccc(C
n (C)
OC (C
c2 )cc1
5 )
NC(=O) C(
n c(N
c [nH]
( [O-])
c1 C
N C(
c( OC)
# N
c1ccc( F)cc1
N S(=O)(=O)
CN 1
c( N)
n 2)
(C) (=O)
CCCC 2
C[NH+] 1
O= C1
n c(C
C (C)C)
C c1ccc(C
c 6
)cc 3
c1cccc 2
Br )cc1
CC 2)c1
S (C)(=O)
N (
C1 CC1
(C (F)(F)F)
ccc (
CC C(=O)N
c3 n
c( NC(=O)
CC[NH+] (C
C( N)
(C) C(=O)
CN (
c1cc 2
CCN 1
C1 =O
c3 c(
C 4
c1ccc( N
c1ccc (C)
c2ccccc2 1
)cc 2)cc1
OC(C) (C)C)
(C(=O)N 2
c (Cl)cc
n n1
O C(
[nH] 1
O CCO
cc (C
C c1cccc(
= C2
=S )
CCC [NH+]
n c3
CCCC (
[Si] (C)
Br) c1
O 1
CCC 3
NC(=O) C1
C(F)(F) F)
cc 3
(CC (=O)
c4ccc (
OC O
c2) c1
c2ccccc 2)cc1
c1cc (C
N1 C(=O)
c4ccccc 4)
C(C) (C)C
O CC(=O)N
c4 )
c2ccc3 c(
n cn
n 2)cc1
Cc1 cn
C 3)
N c1n
n1 )
C(C) (C)
n 3)
=S )N
CCC (C(=O)N
NC(=O) C2
c5 ccccc
CO c1ccccc1
(N) =O)
s1 )
OCC )
(Cl) c1
ccccc 2
c1ccc (Cl)
P (=O)
O) cc1
c2ccc( N
CC c1n
c(Cl) c1
C( N
n (C
2) n1
c2ccc3c( c2)
c( S
c3 cc(
C1 )
c2 s
(F)(F) F)cc
c(F) c1
CCO CC1
C #
CC1 (C)
n cc1
c1ccc (C(=O)N
( CCC
cc c1
I )
c( O)
CO c1cc(
NC(=O) C(C)
c1 =O
CN (C(=O)
3 CCCC
Cc1cc (C)
CC[NH+] 1
c3ccc( F)cc
N =
N2 C(=O)
CC (CC
CC (C)C)
c3ccc 4
n o
CC 4
c2cc 3
CC(=O) [O-])
C )cc1
C c1cccc
s 2)
C(=O)N C(
C(F)(F) F
S(C)(=O) =O)
c3ccc (Cl)cc
l )
c1n cc
c2n c(
c2) CC1
(C O)
c4 cc
(C)C (C)
CCC( O)
c(C 2
C1 =
C(=O)N 2
C2 =O)
CC(=O)N 1
s c1
CC( [NH3+])
OC )cc1
c (C(=O)
(C) c1
( [NH3+])
c1ccc( O
C(=O)N (
=C( N
C= C
c1ccc(C) cc1
c2n cc
CC C(=O)
CN (C)
CCC =
3 )cc1
c(=O) [nH]
(C)C )cc1
c1 s
c1ccc( NC(=O)
c(C) cc
(F) c1
S(=O)(=O)N 2
c1n c(
ccc2 1
(C #N)
OC 3
CO C1
OC) c1
CC 4)
N (C)
C(C #N)
c2ccccc 2)c1
C (C(=O)N
n c(C)
( N
CC( NC(=O)
c1ccc( Br)cc1
CCCC (C)
CC S(=O)(=O)
c s1
C(C) (C)C)
CCCCC 2
C OC
ccccc 3
C1 CCCCC1
C( [NH3+])
c2cc (Cl)
c3cc cc(
c2ccc (Cl)
CCN (CC)
CCCC O
c2cccc (Cl)
N (C
c2ccc( OC
c1ccc (C(=O)
[N+](=O)[O-] )cc1
C(C O)
(CC(=O) [O-])
CCO CCO
c1ccc(C 2
c3 cn
c1 cs
c(C (C)
n 4
c 7
s 3)
nc( S
(CC O)
CN (C
OC(C) =O)
CCN (C
c5ccccc 5
= C1
CCC )
CCCCCCCC CCCC
CC(C)(C) O
CCC NC(=O)
o c(
c1ccc( F)
CCO CC2)
P(=O) ([O-])
c2ccc( Br
(C)C 2
c(N 2
n o1
N (C(=O)
C[NH+] (C)
( CCCC
c2ccc(Cl)cc 2
c(OC) c1
C(O) C(O)
[nH] c(
c1cc (Cl)cc
O) cc
c3ccc(F)cc 3)
CCC n1
c2cccc 3
[NH2+] C
C1 2
c2ccc (C)
c2cc (C)
( c2ccccc2)
CC OC
c( O
O CC1
c (C(=O)[O-])
ccc 4
c2cccc c12
[N+](=O)[O-]) c1
c3ccc (C
N =C
C2 )cc1
n 2)c1
O= S(=O)
c2n cn
c [nH+]
o 2)
C( =
3 CCO
c2 C)
c4 cccc
c( Br)
CCCN (C(=O)
COc1cc (C
F)cc c1
CCCCC 3)
CC[NH+] (C)
c2 cs
CCO C1
c2cccc (F)
CCCCC 2)
n c2)
[n +]
NC(=O) C
c1cccc (Cl)c1
% 1
CCC 4
CCCC 2)
c1 2)
c2ccc(F)cc 2)
C(=O)N C(C
c1ccc( N2
c(C (F)(F)F)
C[NH+] =C(N
c1ccc nc1
Cc1cc (C
S(=O)(=O)N 1
CO c1cccc(
c2ccc(Cl)cc 2)
C( =C
CC[NH+] (CC
( O
(C(C) (C)C)
c2ccc(F)cc 2
CCN( S(=O)(=O)
C1 CCCC1
CCC( [NH3+])
c2 =O)
OC(C O)
c1 c(C)
ccccc 6
C1 O
C(=O) OC
c2cc (F)
=C( N)
C S(=O)(=O)
CC(=O) [O-]
C c2ccccc2
c1cc( N
c3ccc(Cl)cc 3)
N) =O)
CCCN (
c2cc (C
CC (C(=O)N
n2 cc
o 1)
)cc 2)c1
c2 1
CC[NH+] (CC(=O)N
CC c1ccc(
C(C) =O)
[N -]
CC O)
C( NC(=O)
c(C #N)
C( =S)N
c2ccc (C(=O)N
c1 N
c1n cn
C1 CCCC
c2ccc( O
n2 cn
CC(C) O
C= C1
o 3)
(C [NH3+])
CCO c1ccc(
OC(C) (C)C
c2ccc (F)
c3ccccc 2
C(F)(F) C(F)(F)
C[NH+] 2
C2 =O)cc1
c2ccccc2) CC1
CCC( NC(=O)
c2ccc (C)cc
Cc1cc 2
CCC S
c( cc1
= [NH2+]
CCN (CC
C2 CC2)
c1 O
CCC (CC)
c1 c[nH]
c1cccc (F)c1
CCCCC 1)
[nH] c(=O)
c1ccc s1
N (C)C(=O)
CC[NH2+] CC1
n cc2
)cc cc1
c( OC
c o
[N+] ([O-])
CCN1 C(=O)
(N) (=O)
n nc1
CC c1ccccc1
c3ccc4 c(
C O)
Cc1ccc (C)
c6 ccccc6
CC1 (
c2 c(C)
c2) C1
C(C) C(=O)N
s 2)cc1
( c1ccccc1)
n1 C
CN1 C(=O)
)cc 4
N 3
n 2)CC1
CC( O
n (CC
C[NH+] (C
C 2)c1
n n2
= C(O)
C1 CCC
CCN C(N
C c1cccc(C
[NH+] (C)C)
Cc1ccc( NC(=O)
CC( [NH2+]
c2 n1
OC c1ccccc1
c2) n1
c1cc ncc1
C c1ccc2
3CCO CC3)
c1 [nH]
(C(C) (C)C
c2n c3ccccc3
CCCCCCCC CCCCCCCC
c( Br)c1
C #N)
O= [N+]([O-])
Br )ccc1
- 2
)cc2 1
Cc1 cs
C(=O) O
(F) F)
C 5
Cc1ccc (C(=O)N
(C(=O) [O-]
3) CC1
)cc 4)
)cc 2)CC1
c( F)cc
C #N
C= C(
c3ccc (C)cc
c(C 3
c(F) c(F)
nc1 2
c1n nc(
c3ccc4c( c3)
(F)(F) F)cc1
c1cc (C)
CCO c1ccccc1
CC( N
CC[NH+] (C(C)
c5 ccc
n [nH]
o 2)cc1
CC2) CC1
(C (C)C)
NC( =S)N
C1 (
CCCC (=O)N
CC(C) (C)C
C) c1
c2 [nH]
c2ccccc2 F)
S (N)(=O)
c1ccc( O)cc1
) C(=O)
c1c( F)cc
CC1 2
CC #
nc( N)
S 1
c2cc(Cl) ccc2
NC(=O) C(C
CCN 2
CC2) n1
cc( N
3) c1
CC C(=O)[O-])
CO c1ccc2
C1 CC
S C
NC(=O) CS
c2cc( Br)
Cl )cc1
c2ccccc2 Cl)
c1n c2ccccc2
CCC(C) (C)
=O) cc
c2cc ncc
N (CC
n c3)
CN 2
CC(=O) O
c2ccccc2) C1
Cc1n c(
CN (C)C(=O)
[NH+] 3
C(=O)N (C
C= C(C)
c1 c(Cl)cc
CC[NH+] (CC)
c1ccc( [N+](=O)[O-])cc1
CCC [NH+]1
O) c1
OC(C) (C)
CO c1cccc
6 )
CC1 =
n cn1
N C1
c3ccc( OC
(C(=O) OC)
c1ccccc1 )N
c2ccc( [N+](=O)[O-]
(C)C) c1
COc1cc 2
[NH+] (C)
CCN (C(=O)N
C1 C
CC[NH+](C(C) C(=O)N
nc2 c1
CN (CC
c3ccc( N
s c2c1
c2cc (C(=O)N
OC) c(OC)
CCCC (=O)
c2ccc( NC(=O)
Cc1ccc( N
O [Si](C)
c2c( F)cc
C(N) =O
CC( =
S )
C (C(=O)[O-])
c3 s
C(=O)N C1
c1cc (Cl)
CC2 )ccc1
c2cc 1
3CCCC 3)
CCCCC 3
c2cccc c12)
c1n c(N
CC =C
CCC (CC
NC(=O)C( [NH3+])
COc1ccc(C 2
C( CC)
CC(=O)N 2
c3 ncc
S(C)(=O) =O
cc 4
Cn1 cc
c4ccc 5
CCC( O
CCCC CCCCC
cc( Br)
(C(C) =O)
c2ccc s2)
C(N) =O)
c1ccc( OC)cc1
c3 C)
c 8
c5ccccc 5)
Cc1cc (C(=O)N
c2ccc nc2
[NH2+] C2
C(=O) C1
CC l)
c4 c(
c2cccc (C)
C(F) F)
CCC= CCC=
c1cc(Cl)cc c1
CCC N1
n c1)
ccccc 4
C( OC
[NH+] (C)C
CC1 CCCC
CC[NH+] 2
C[NH2+] C1
O=C(N C1
=N NC(=O)
CO c1cccc(C
=[NH2+] )
Cc1n o
c1ccc( Br)
c1ccc2 ccccc2
CCC 2)
(C)C 3
CCN (C)
c3ccc(Cl)cc 3
Cc1ccc( F)cc1
)cc( OC)c1
c1ccc(Cl)cc1 )
c2ccc nc2)
c1ccccc1 Cl
c(=O) n1
CCC N1C(=O)
c1ccc(F)cc1 )
CCCC 3
c1ccc(C (C)
)cc1 )
3CCCC 3
CCC( N
c3ccc (Cl)
c3ccc s3)
s c2
# C
c3cccc (Cl)
c5 ccc(
O CC2
C (Cl)
n1 cn
c2n nc(
cn 2
c1cccc( NC(=O)
( c3ccccc3)
c(=O) n2
CC2) C1
CCC 3)
c3cccc 4
c1cccc2 c1
ccc2 c1
n c4
CC1 (C)C
c3cc 4
CC (C(=O)[O-])
CC1 (C
c1ccc2c(c1) OCO
COC(=O) C1
CCOC(=O) C1
Cc1 s
c3 c2
=C( [O-])
c2ccccc2) n1
CCC (C)C
CC(CC (C
Br )cc
c1ccc o1
( OC)
N C2
CCO c1cc(C
C(F) F
c4ccc( F)cc
= C(C
c3 nn
(CC 2
CC(C) C1
c3cc (Cl)
= C(C)
c1cc (C(=O)N
c %1
n1 cc
c1cc( F)ccc1
c(C(=O)N 2
CCCC (C
OCC (C
3 C)
3) C2
c1ncc cc1
CC1 C
CCO 1
cccc c12
3 CC3)
= CC(=O)
o c1
c1n c(C
3) C1
ccccc 7
C= N
CCCC )
CC (F)(F)
2)C1 =O
c1ccccc1 F
c( [N+](=O)[O-])
CC(C) [NH2+]
c5 )
n 4)
O 2
OC (C)C)
C3 =O)
c( [O-])
CCCCC 2)cc1
Cc1ccc (Cl)cc1
CC(C) (O)
c2ccc o2)
CCCO 1
c1cc (C)cc
c2cc(F) ccc2
CCCC CC1
c2cc3 c(
c2cccc (C(F)(F)F)
n2 ccc
OC (C)C
O CCC
= C(C#N)
CC(C O)
CC( N)=O)
O=C(C S
CCO CC1)
c3cc (C)
n [nH]1
C2 CCCC
O P(=O)([O-])
[NH2+] C)
c2 c[nH]
CC[NH2+] C1
4 CCCC
Cc1n n(C)
CC C(=O)N1
( NC(=O)
C(F)(F) F)cc
c(C)cc (C)
c( [N+](=O)[O-])c1
c1cc( Br)ccc1
c1c(F)cc cc1
N c2n
c3 nc(
=C2 S
c3ccc(C)cc 3)
S(=O)(=O) [O-])
c3cccc n3)
C[NH2+] C(
c2cccc n2)
c2 F)
c2cccc (C
CCO c1ccc(C
[nH] c1
c1cc( F)cc
[Si](C) (C)
c1cc( Br)
c2 c(Cl)cc
c(C) n1
c3ccc(F)cc 3
c1cccc n1
C(=O) C(
C(C) O
C( =[NH+]
CCCC [NH3+])
c2ccc s
c1cc (F)
c3ccc o3)
o c(C
Cc1 [nH]
CC [NH3+])
cn 2)
cc2 1
c(Cl) c2)
c2cccc( Br)
C= CC=
c2ccc(C (F)(F)F)cc
COc1ccc( OC)
=O) c1
[NH3+] C1
c2ccc(Br )cc2
c1cccc (C)c1
= C)
c3ccc( Br
C c3ccccc3
c(S CC(=O)N
c1 c(C
nc(N 2
NC(=O) CO
c1ccc (C(=O)N2
c2ccc3 ccccc3
Cc1ccc( S(=O)(=O)N
c( S(=O)(=O)N
= CC=
CO c1ccc(C(=O)N
CCN(CC) C(=O)
C (C(=O)
n1 2
C2 =O
)ccc1 O
c1ccc(C (F)(F)F)cc1
CC1 (O)
c(Cl) c3)
[NH2+] C1
(C) (C)
c1ccc( S(=O)(=O)N
c(N 3
c2ccccc2 -
Cc1ccc( O
CCCC 1)
c1ccccc1) c1ccccc1
CC(C)(C)O C(=O)N1
c1ccc s1)
c7 ccccc7
c2cc( N
c2ccc3c(c2) OCO
S CC(=O)N
NC(=O) N1
c4 cc(
c3ccc (C(=O)N
c(C) c(C)
c2ccc(N 3
(F)(F)F) c1
OCCO 2
) C1
#N )cc1
c2n c(C
c3ccccc3 2)
CC 5
C 4)
nn 3
CCN S(=O)(=O)
C( OC(C)=O)
O c1ccccc1
C3 CC3)
C(=O) C2
[ C
Cc1n cc
c1ccc2c( c1
C(C c1ccccc1)
C) CC1
(C) (C)C)
C(=O)N (C)
c3cc ncc
=C2 C(=O)
NC(=O) OC(C)(C)C)
c2c(F)cc cc2
F C(F)(F)
o n1
[NH2+] CC
n 2)C1
CCCC 3)
CCC (C(=O)[O-])
4 CCO
c3cccc (F)
O CC(O)
c1 o
C= C(C
Cn1 cn
O=C([O-]) C1
C2) n1
CCO CC2)cc1
[NH+] =C(N)
N =C(
CO CC1
c3 c(C)
c3ccccc2 3)
)cc n1
c1ccc( OC
[O-] )cc1
c2ccc( Br)
CCC[NH2+] C1
Cc1cc( N
CC[NH2+] C(
c1cccc (C(=O)N
NC(=O) CNC(=O)
C(=O)[O-] )cc1
c1ccc( c2n
OC c1ccccc1)
C( O
[nH] 2)
c3ccc( O
C[NH+] (C)C
Cl) c1
= CC(=O)N
cc cc(
N) c1
c2cccc(Cl) c2)
C= CC1
[nH] 1)
CCC O)
(C)C(C) (C)C)
c3ccc nc3)
o 2)c1
CCC1 2
[NH+] (C
n2 c(
c4ccc (Cl)cc
c3ccccc3 F)
OC(CO) C(O)C(O)
[nH] c2c1
c2ccc(C)cc 2)
c(N C
NC(=O) C[NH+]1
C(=O)N C(C)
NC( =S)
C c1ccc2c(c1)
c2ccc( O)
CCC2 (
= C3
Cc1cc (Cl)cc
c2cccc (C(=O)N
c2cc s
CO CCO
C(F)(F) F)cc1
C(C)C )cc1
Cc1ccc( N2
CN S(=O)(=O)
C 2)CC1
C( OC(=O)
CC1 CC1
c2 o
c2ccc( S(=O)(=O)N
c(=O) n(C)
Cc1n c(C
C1 =O)
NC(=O) N2
C2 O)
N N
2 )ccc1
cn c1
cc (C)
= [N+]
CCCC CC
C 2)C1
c1cc2 ccccc2
C= CC
c1n n
[nH+] 1
CO c1ccc2c(c1)
c2ccc(F) c(F)
3 CCCCC3)
c1cc (C2
O=S(=O) (N
c1cccc( N
C(C) =O
(C(=O) O
)cc2) n1
OC c2ccccc2)
CC( OC(=O)
c1ccc(O)cc1 )
CCC[NH+] (C
O=C(C 1
S C1
CC1 O
CC l
c3ccccc3 2)cc1
c1cccc( Br)c1
CC OC2
nc1 C
c1ccc( OC)
c1cn cc
CC(=O)N (
)N C1
c3ccccc3 Cl)
(Cl) c1)
)cc 2)C1
cn1 )
CS c1n
c3n cn
c3ccc (F)
(C) C1
c3cccc(Cl) c3)
CC(C) (C
C= CCn1
c2ncc cc2
(F) c1)
( Br)
C(N) =[NH+]
Br )cc(
C( OC)
c2ccc( O)cc
c(Cl) c1)
ccc (C
c1n cc(
C( c2ccccc2)
c( F)cc1
c3ccc (C)
c1c[nH] c2ccccc12)
c1cc2 c(cc1
C) C1
c1ccccc1 O
[NH3+] )cc1
CCN( c2n
c2cccc(F) c2)
c (Cl)cc1
Cl) CC1
CO c1ccc(Cl)cc1
c3cc (F)
c1cccc( O
C(=O) OCC
c1ccc o1)
4 )cc3)
CCCC 2)cc1
c4 n
O 2)
[NH+]2 CCC(C(=O)N
O=S(=O) (
c2 C)cc1
[NH2+] C(C)
c2ccc (CC
Cc1 o
c1cc sc1
CCn1 cc
[n -]
4) CC3)
c(C(C) (C)C)
4 )cc3
Cc1ccc(C 2
C(=O)N1 CCCC1
=C(O) C(=O)N(
c(=O) o
c1cc2 c(
Cc1 c(
[ P
c2cc( F)cc
c2 =O)cc1
cn 3)
CCC N2C(=O)
c1ccc2ccccc2 c1
c2ccc(C) cc2
[n+] 1
ccc 5
)cc2 c1
c4ccccc4 3)
)cc(OC)c1 OC
c1ccccc1 F)
O=C(C O
c3cc (C(=O)N
C[NH2+] C(C
)N (C
c4 cn
S(=O)(=O) [O-]
CC( N)
c(N) c1
nc(C 2
s 2)c1
C c1cccc2
c2cc (Cl)cc
C( =N
c1ccccc1) C(=O)
CC(C)(C)O C(=O)N
NC(=O) COC(=O)
CC1 CCCCC1
c(O) c1
nn n1
c1 =O)
Cn1 cc(
(CCC )
c1ccc(Cl)cc1 Cl
c1ccc(F) c(F)c1
n 5
c2s ccc2
n cc(
CCC( N)=O)
c3cc(Cl) ccc3
c1ccc( S
COc1ccc( c2n
Cc1ccc nc1
CC c1
c2ccc(C #N
Cc1cccc (C)c1
CCC[NH+] =C(N)
c2ccc(Br )cc2)
c1cn cc(
C( CC(C)C)
c2cc( OC)
[P +]
c3 [nH]
)ccc1 Cl
O CCCO
= [N-]
3) C1)
CC2 CCC1
[NH2+] 1
CO c1ccc(C)cc1
n c(C(=O)N
C1 (C)
nc2 1
CCC c1n
[S -]
c3cccc (C)
CCS(=O)(=O) C1
c1ccc2c(c1)OCO 2
nc2 n1
c1ccc(Cl) c(Cl)c1
c2ccc(C 3
n3 cn
C[NH+]2 CCC(C(=O)N
CC(C) n1
S(=O)(=O) c1ccccc1
CC (F)
OC )cc
c3 =O)
c2ccccc2 1)
C) n1
[Si](C) (C)C)
c2cc(Br) ccc2
4 CCCCC
cn n1
) c1ccccc1
CCC(C O)
CO c1ccc(C(=O)
c2cc3c( cc2
CC (F)(F)F)
C(=O)N C2
c2cccc3 ccccc2
[NH2+] CC2
(C(=O)N C
=C (C(=O)
CCCCC 2)c1
c1cccc (C2
n2 C
n (CC(=O)N
CC[NH2+] C(C
c1c(Cl)cc cc1
c(C) cc1
C S(=O)(=O)N
c3ccncc 3)
CC[NH+] (C2
c3cccc(F) c3)
COc1ccc( NC(=O)
C( c1ccccc1)
CC 5)
)ccc1 OC
C= C(C)C
c2ccncc 2)
C(=O)N C(C(=O)N
(=O) [nH]
c 9
N =N
c1ccc( n2
c1cccc(C (F)(F)F)c1
C(=O)N (CC
c1 c(N
c2cccc( [N+](=O)[O-])
S1 (=O)
(CC) CC
c2ccc(F)cc 2)cc1
nc(S CC(=O)N
( OCC)
CC1 CN(
cn 2)cc1
CC c1ccc(C
CC1 CO
C1 CCN(C(=O)
c1n c2c(
c2n nc(C
c3n c4ccccc4
nc1 N
CC OC(C
CCC [NH+]2
C1= C(C)
c2ccccc2 n1
n (C2
c(C (N)=O)
CC( S
C1 CCC2
CC[NH+] (
c(=O) c1
NC(=O) c1ccccc1
c2 C1
nc(S C
c2cc3 ccccc3
C[NH2+] C(C)
c1cs c(
c4cc cc(
c2ccc(Cl)cc 2)cc1
OC 4
CC2 1
c1n c(C)
S(C)(=O) =O)cc1
CCC[NH+]=C(N) N)
C1 C2
c2n n
[nH] 3)
s c3
Cc1 c(NC(=O)
c2ccccc2 C1
CCC[NH2+] C(
CC c1cn
NC( N)
CCCC 2)c1
c1cc(C (F)(F)F)cc
C[NH+] (CC
c4ccc (C
c2n c(C)
c2cc(C) ccc2
)ccc1 F
S C)
CCC1 )
c2c( c1)
3 4)
ncc c1
c3ccc( [N+](=O)[O-]
(N) =[NH+]
NC(=O) C3
4CCO CC4)
Cc1cc( F)ccc1
cc (Cl)
c(C O
CC(C) C(
CC(C [NH3+])
OC(C) =O
3 CC4
CCO C(
CC1 CC1)
C [NH3+]
n2 c1
c2ccc(OC )cc2)
I) c1
CCC2( CC1)
CC =C(
(CC) CC)
c1cccc n1)
CN (C(=O)N
O= c1
Cc1ccc( n2
CC(=O) OC1
c(=O) n(
c4ccc5 c(
c2ccc(Cl)cc2 Cl)
CC (Cl)
C= O
COc1cc (C)
C(=O)N C
c(S C
O CCCC
C= CCO
c3cccc (C(=O)N
CC[NH+] (C)C
C2=O) c1
c4ccc(F)cc 4)
CCCC( [NH3+])
Cc1cc(C) cc(
CCC l)
N c1ccc(
CC(C)(C) OC(=O)
cn c2
cn 3
)cc 5
c2cccc(Cl) c2
n3 cc
c1cccc2 ccccc12
c( =S)
F)cc 2
OC c3ccccc3)
CCCC (O)
CCOCCO CCOCCO
Cc1ccc (C(=O)
S(N)(=O) =O)
C(C) C1
CC(C) =
c1cc( N2
CCC(C) NC(=O)
CC NC(=O)N
c1ccccc1 Cl)
c1cccc( [N+](=O)[O-])c1
Cc1no c(C)c1
C 6
c1cccc (Cl)c1)
C( OC2
- 3
N C(C)=O)
c2cccc( OC)
c4ccccc4 )cc3)
CC2)c1 C
c s1)
c3ccc(OC )cc3)
c1cc( [N+](=O)[O-]
COc1ccc( N
CCC N2
CS C1
Cc1ccc( F)
N c1ccccc1
ccc3 C)
CC c3ccccc3
O 3)
O=C1 N
c2ccc( c3ccccc3
[NH3+] )N
c1ccc nc1)
I )cc1
C [NH3+])
c(=O) c2
O [Si]
CC(=O)N C1
c3ccc nc3
c1cc (=O)
)cc cc2
CO c1
s 2)CC1
(N) =S)
O=C(C OC(=O)
Cc1n n(
c(F) c3)
CO P(=O)([O-])
c2c(Cl)cc cc2
Cc1ccc( c2n
cc1 2
(c1ccccc1) c1ccccc1
(C(C) (C)
C c1ccccc1)
c1ccc(N )cc1
n c(Cl)
N (C)C
C(=O) C3
C2 CC2)cc1
CCN(C(=O) C2
O C(F)(F)F)
c2ccc (C(=O)
COc1cc2 c(cc1
CCC OC(=O)
H ]
CC3 CC(CC(C
c[nH] 1)
(C)cc (C)
(C (N)=O)
CCO C(=O)N1
c2ccccc2 c1
NC(=O) CC
S C2
c5ccc 6
n2) n1
C(=O)N (C)C
CCC (C)C)
CCNC(=O) C1
CCC( [NH2+]
CCCC n1
O c1ccc(
CCCO C1
c3ccc(Br )cc3)
Cc1 c(C
CC3CC(CC(C 3)C1)
OCC 3
ncc 3
c3c( F)cc
c2ccc (C(C)(C)C
CCN(C(=O) OC(C)(C)C)
OCO 4)
Cc1 c(Cl)cc
CC= CC=
c5 cccc
=C(O) C(=O)N2
C= CC(=O)
)N1 CCN(
COc1ccc( S(=O)(=O)N
e ]
CCC3 (CC
(CC (C)C)
c2n c(N
c2 c(C)cc
CC1 CCCC1
7 )
OC(=O) CCCCCCCC
c( =
CCN C(=[NH+]
c2n nn
c2ccc(F)cc 2)CC1
c2ccc3c(c2)OCO 3)
C(O) C1
F) c1
n c2ccccc21
CC( =N
nn1 C
C(C [NH3+])
c -2
(CC l)
C1 CC1)
Br )cc2
O=C(C [NH+]1
)cc (C
c2ccc( OC)
[NH3+] C(
n2 c(=O)
cs 2)
(C c2ccccc2)
CC(C) NC(=O)
c5 cc
CCN (C)C(=O)
nn c2
CO CC[NH2+]
C[NH2+] CC1
[nH+] cc
cs 2)cc1
(C)C )cc3)
ccccc 5
O=C(C n1
c4ccc5c( c4)
c2n cc(
c4ccc (C)cc
CC3 )cc2
c2cn cc
nc2 s
CCCC NC(=O)
NC(=O)N C2
CCO CC2
Cc1ccc (Cl)
n2 cc(
CCC #N)
c2ccc o
n nc(
cccc 3
c1ccc( O)
[nH]c( =S)
(CC (C)
[nH] c2
c( c3ccccc3)
c( OC)cc1
CC[NH2+] CC2)
no 2)
ccccc 8
CCCN (C
N )cc1
c1ccc( S(=O)(=O)N2
CCO CC2)c1
[C -]
n(C) c1
c1c( N)
Cc1ccc( S(=O)(=O)N2
N1 CCCC1
c4ccccc 34)
CC(C) [NH+]1
4) c3)
c3ccc4 ccccc4
c1cccc (F)c1)
c2ccc (C(=O)[O-]
CC1 CN(C(=O)
C(=O)N c1ccccc1
c2ccc(C)cc 2)cc1
C(=O) c1ccccc1
CCC [NH3+])
NC( N
COc1cc( OC)
c1s ccc1
C(C c2ccccc2)
C(F)(F)C(F)(F) C(F)(F)C(F)(F)
c3 cs
Cc1ccc( S(=O)(=O)
ccc n1
CC(C) c1n
o c2c1
[nH] 2)cc1
(C(F)(F)F) c3)
CCCC [NH2+]
OC )cc(
s c1C
Cc1 c(C)
Cl) C1
c(F)cc 2
3 )cc2
c3c( c2
c2cc( N)
B (O)
C(=O) OC)
C(O) C1O
ncn c1
C c2ccccc2)
c1n c(N)
O=C(N CC1
C NC(=O)N
CCCO 1)
CC(C)(C) C1
c1cc( NC(=O)
CCC(=O)N 2
c(C) c3)
c2cc o
(C)C(C) (C)C
Cc1c(Cl)cc cc1
Cc1cc (=O)
c2cn n(C)
c3ccccc3) CC2)
c(=O)[nH] c1=O
CCC OC
c3ccc(C (F)(F)F)cc
(C NC(=O)
c6 ccc
4 CC4)
c(C (C)C)
c(F) c1)
nn (
)cc1 2
CC(C)C (C)
CCCCC O
c2n o
O[Si](C) (C)C(C)(C)C)
CCCC (C)C
c(Cl)cc 2
CCCC OC(=O)
CCC[NH2+] 1
CC(C #N)
c6ccccc6 )
n(C) n1
[N+] 1
(CCCC )
NC( =[NH+]
CC [NH3+]
n2 nn
cn 2)CC1
c2s c(
s 4)
CCOC(=O) c1c(
c2n ccc
c1 c(Cl)
c1cc( O)
C2 CCCCC2
c(C)c1 C
C2 (C)
cc 5
c2ccc(F)cc 2)c1
c4cccc 5
Cc1cc( N2
CC[NH2+] C(C)
Cn1 c(=O)
Cc1ccc( Br)cc1
CCCC N
CC(C) (C)C)
c(F) c2)
c(F)c1 F
C OC(C
C1 (C)C
C(C)C) c1
c4 c3
c2ccc( c3ccc(
c1ccc(F)cc1 F
C( Br)
[NH+]2 CCOCC2)
CC(=O)N (C
Cc1cc (C(=O)N2
CCCO 2)
c2cc (C(F)(F)F)
c2cccc(C(F)(F)F) c2)
CCC (F)(F)
Cc1cccc (C(=O)N
C(C)C 2
C[NH+]1 CCN(
c1C #N
# [N+]
C2 CC3
c1cccc (C)
)N1 CCC(
CC S(=O)(=O)N
Cc1cc sc1
([O-]) =C2C(=O)
CO CCNC(=O)
c1ccc2 [nH]
Cc1cc ncc1
c(=O) n3
)ccc1 N
Cc1ccc o1
OC(C) C(=O)N
c2ccc(F)cc2 F)
CO 1
C2 C3
S C(=C
c2cs c(
CCN (CC(=O)N
Cc1ccc( OC
c1ccccc1 NC(=O)
CC c2c(
n2 C)
CCC[NH2+] C(C
Cc1 c(C(=O)N
c2ccc3c(c2) OCCO
[C-] #[N+]
CC(F)(F) F
ncn 2
CC C(=O)[O-]
c2ccc(Cl) c(Cl)
Cc1ccc (C(=O)N2
CCN(CC) S(=O)(=O)
C3 CCCCC3)
c1ccc( OCC
c1cn c(
c1ccccc1 N
4) C2)
)cc (=O)
=N N
c(C(F)(F)F) c1
nn (C)
C= C2
[Si](C) (C)C
)N1 CCCC1
C3 O)
c1cn n(
c2cccc3 c2
c3cc (C
CO C(
C(C (C)C)
CCCCC (CC)
[nH] c3
c1 Cl
c2cc (O)
=O) N
c2 c(C
CN(C) S(=O)(=O)
O= c1[nH]
CC( =C
S 2
c( CC)
CC[NH2+] CC3)
C1 CCC1
NC(N) =[NH+]
CCN2 C(=O)
c8 ccccc8
CO CCn1
C(C) CC
CC2 )cccc1
CC c1cc
CCC(C [NH3+])
c1cc( O
C(C) O)
)cc (C)c1
NC(=O)C[NH+]1 CCC(C(=O)N
c(C) c2)
CCO c1ccc(C2
[n+] 2
c2cccc( O)
c3ccccc3 C)
n c2)c1
N C1=O
)cc (Cl)c1
ccc2 n1
c4cc 5
c3ccc4c(c3) OCO4)
cc cc1
CO c1c(
(C)C(C) (C)
CCCN( S(=O)(=O)
c1n c(Cl)
c1n nc(C
c(C(=O)[O-]) c1
c2nc( c3ccccc3)
O 1)
n c2ccccc12
Cc1cc( NC(=O)
c1ccc( N)
ccc( N
c1cn c[nH]1)
c3ccccc3 -
n c4)
CC2) c(C)c1
cn 2)c1
O=C(C =C
c1cc( OC
c2ccc(O)cc 2)
CCN(C(=O) C
C(=O)NC(C c1ccccc1)
c2ccc(Cl)cc 2)c1
C(=O) OC1
CC(C) N
c2cc( S(=O)(=O)N
cc1 C
CC(C) (
) C(=O)[O-]
c2cc( [N+](=O)[O-])
CCS C1
= CC1
C(C 2
c2ccc([N+](=O)[O-] )cc2)
c2ccc(Cl) c(Cl)c2)
CC(O) C1
Cc1cc( Br)
[NH3+] C(C
c2cn 3
Cc1n c(N
c1ccc(C #N)cc1
NC(=O)C(C) [NH+]1
ccc3 Cl)
c2c( c1
OC) C1
c2c(C)cc cc2
c2ccc([N+](=O)[O-] )cc2
c1n c(C2
nn nc1
C( CC(=O)[O-])
C3 )cc1
c2 c(Cl)
CCC (C2
CNC(=O) C1
n2cc nc2
c(C) c(
c2ccc( OCC
C= CC(=O)N
COc1ccc(C (C)
CCC (C(=O)N2
C(F) F)cc1
)ccc1 2
c1ccc2c(c1 )N
c1ccccc1 C
3 )cc2)cc1
CCCCC (
CCCCC 2)CC1
CC2 (CC
nn 2)
c( OCC)
COc1cc (C2
O CC(=O)
(C)C) n1
[NH+] (CC
c1cc( N)
c(=O) n(C
Nc1n cn
c2ccccc2 c1=O
C( =S)
c2ccc( OC)c(OC)
)cc 5)
C(N) =[NH2+])
C2 1
nn 3)
c(C(=O)N C
OCO 2
c( Br)cc1
3 )cc2)
c1ccc( N2C(=O)
CCC S(=O)(=O)
CCCC CC)
(C)C )cc2)
CCC1 (C)
c3c(F)cc cc3
(C(=O) OCC)
c1ccc(C(C) (C)C)cc1
P (
COc1cc (C(=O)N
cccc c12)
c1ccc2c(c1) OCCO2
C2 C1
3CCO CC3
C(=O) C(=O)N2
c1ccc( c2ccccc2)cc1
(CC(=O)N 2
