{
    "version": "1.0",
    "truncation": null,
    "padding": null,
    "added_tokens": [
        {
            "id": 0,
            "content": "<pad>",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 1,
            "content": "<s>",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 2,
            "content": "</s>",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 3,
            "content": "<unk>",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        }
    ],
    "normalizer": {
        "type": "Strip",
        "strip_left": false,
        "strip_right": true
    },
    "pre_tokenizer": null,
    "post_processor": {
        "type": "TemplateProcessing",
        "single": [
            {
                "SpecialToken": {
                    "id": "<s>",
                    "type_id": 0
                }
            },
            {
                "Sequence": {
                    "id": "A",
                    "type_id": 0
                }
            },
            {
                "SpecialToken": {
                    "id": "</s>",
                    "type_id": 0
                }
            }
        ],
        "pair": [
            {
                "Sequence": {
                    "id": "A",
                    "type_id": 0
                }
            },
            {
                "Sequence": {
                    "id": "B",
                    "type_id": 1
                }
            }
        ],
        "special_tokens": {
            "</s>": {
                "id": "</s>",
                "ids": [
                    2
                ],
                "tokens": [
                    "</s>"
                ]
            },
            "<s>": {
                "id": "<s>",
                "ids": [
                    1
                ],
                "tokens": [
                    "<s>"
                ]
            }
        }
    },
    "decoder": {
        "type": "Metaspace",
        "replacement": "\u2581",
        "add_prefix_space": true
    },
    "model": {
        "type": "BPE",
        "dropout": null,
        "unk_token": "<unk>",
        "continuing_subword_prefix": null,
        "end_of_word_suffix": "",
        "fuse_unk": false,
        "vocab": {
            "<pad>": 0,
            "<s>": 1,
            "</s>": 2,
            "<unk>": 3,
            "#": 4,
            "%": 5,
            "(": 6,
            ")": 7,
            "*": 8,
            "+": 9,
            "-": 10,
            ".": 11,
            "/": 12,
            "0": 13,
            "1": 14,
            "2": 15,
            "3": 16,
            "4": 17,
            "5": 18,
            "6": 19,
            "7": 20,
            "8": 21,
            "9": 22,
            ":": 23,
            "=": 24,
            "@": 25,
            "A": 26
        },
        "merges": []
    }
}