{
    "version": "1.0",
    "truncation": null,
    "padding": null,
    "added_tokens": [
        {
            "id": 0,
            "content": "<pad>",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 1,
            "content": "<s>",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 2,
            "content": "</s>",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 3,
            "content": "<unk>",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        }
    ],
    "normalizer": {
        "type": "Strip",
        "strip_left": false,
        "strip_right": true
    },
    "pre_tokenizer": null,
    "post_processor": {
        "type": "TemplateProcessing",
        "single": [
            {
                "SpecialToken": {
                    "id": "<s>",
                    "type_id": 0
                }
            },
            {
                "Sequence": {
                    "id": "A",
                    "type_id": 0
                }
            },
            {
                "SpecialToken": {
                    "id": "</s>",
                    "type_id": 0
                }
            }
        ],
        "pair": [
            {
                "Sequence": {
                    "id": "A",
                    "type_id": 0
                }
            },
            {
                "Sequence": {
                    "id": "B",
                    "type_id": 1
                }
            }
        ],
        "special_tokens": {
            "</s>": {
                "id": "</s>",
                "ids": [
                    2
                ],
                "tokens": [
                    "</s>"
                ]
            },
            "<s>": {
                "id": "<s>",
                "ids": [
                    1
                ],
                "tokens": [
                    "<s>"
                ]
            }
        }
    },
    "decoder": {
        "type": "Metaspace",
        "replacement": "\u2581",
        "add_prefix_space": true
    },
    "model": {
        "type": "BPE",
        "dropout": null,
        "unk_token": "<unk>",
        "continuing_subword_prefix": null,
        "end_of_word_suffix": "",
        "fuse_unk": false,
        "vocab": {
            "<pad>": 0,
            "<s>": 1,
            "</s>": 2,
            "<unk>": 3,
            "%": 4,
            "(": 5,
            ")": 6,
            "*": 7,
            "+": 8,
            "-": 9,
            ".": 10,
            "/": 11,
            "0": 12,
            "1": 13,
            "2": 14,
            "3": 15,
            "4": 16,
            "5": 17,
            "6": 18,
            "7": 19,
            "8": 20,
            "9": 21,
            ":": 22,
            "=": 23,
            "@": 24,
            "A": 25,
            "B": 26,
            "C": 27,
            "D": 28,
            "E": 29,
            "F": 30,
            "G": 31,
            "H": 32,
            "I": 33,
            "K": 34,
            "L": 35,
            "M": 36,
            "N": 37,
            "O": 38,
            "P": 39,
            "R": 40,
            "S": 41,
            "T": 42,
            "U": 43,
            "V": 44,
            "W": 45,
            "X": 46,
            "Y": 47,
            "Z": 48,
            "[": 49,
            "\\": 50,
            "]": 51,
            "a": 52,
            "b": 53,
            "c": 54,
            "d": 55,
            "e": 56,
            "f": 57,
            "g": 58,
            "h": 59,
            "i": 60,
            "k": 61,
            "l": 62,
            "m": 63,
            "n": 64,
            "o": 65,
            "p": 66,
            "r": 67,
            "s": 68,
            "t": 69,
            "u": 70,
            "v": 71,
            "w": 72,
            "x": 73,
            "y": 74,
            "z": 75,
            "cc": 76,
            "CC": 77,
            "(C": 78,
            "c1": 79,
            "O)": 80,
            "=O)": 81,
            "(=O)": 82,
            "ccc": 83,
            "(C)": 84,
            "c2": 85,
            "C(=O)": 86,
            ")cc": 87,
            "+]": 88,
            "[N": 89,
            "CCC": 90,
            "c1cc": 91,
            "[NH": 92,
            "c1ccc": 93,
            "c(": 94,
            "C(": 95,
            "c3": 96,
            "2)": 97,
            "F)": 98,
            "C1": 99,
            "CCCC": 100,
            "c2cc": 101,
            "OC": 102,
            "c1cccc": 103,
            "NC(=O)": 104,
            ")cc1": 105,
            "CC1": 106,
            "(=O)N": 107,
            "(C)C": 108,
            "-]": 109,
            "CO": 110,
            "c1ccc(": 111,
            "[O": 112,
            "[O-]": 113,
            "n1": 114,
            "[NH+]": 115,
            "c2ccc": 116,
            "3)": 117,
            "(Cl": 118,
            "(F)": 119,
            "c1ccccc1": 120,
            "ccccc": 121,
            "CCO": 122,
            "C(=O)N": 123,
            "2+]": 124,
            "[NH2+]": 125,
            "c2ccccc": 126,
            "(CC": 127,
            "C2": 128,
            "[O-])": 129,
            "cn": 130,
            "c1n": 131,
            "S(=O)": 132,
            "[n": 133,
            "O=": 134,
            "N)": 135,
            "CCN": 136,
            "(C(=O)": 137,
            "[nH": 138,
            "(C(=O)N": 139,
            "c4": 140,
            "(Cl)": 141,
            "Br": 142,
            "CC(C)": 143,
            "C(C)": 144,
            "[nH]": 145,
            "(C)C)": 146,
            "CC(": 147,
            "2)cc1": 148,
            "c(C": 149,
            "3+]": 150,
            "[NH3+]": 151,
            "c3ccc": 152,
            "c2ccc(": 153,
            "CN": 154,
            "C(C": 155,
            "c(C)": 156,
            "c3ccccc": 157,
            "CCCCC": 158,
            "Cl": 159,
            "C=": 160,
            "S(=O)(=O)": 161,
            "cc(": 162,
            "c2)": 163,
            "cc1": 164,
            "c2n": 165,
            "OC)": 166,
            "c2ccccc2": 167,
            "O=C(": 168,
            "c1cc(": 169,
            "F)cc": 170,
            "c1ccc(C": 171,
            "CC(=O)N": 172,
            ")N": 173,
            "n2": 174,
            "CC2": 175,
            "[N+]": 176,
            "C)": 177,
            "2)c1": 178,
            "[NH3+])": 179,
            "Br)": 180,
            "CC[NH+]": 181,
            "4)": 182,
            "c(N": 183,
            "CCC(": 184,
            "c2ccccc2)": 185,
            "=O": 186,
            "(Cl)cc": 187,
            "(F)(F)": 188,
            "c1)": 189,
            "c(=O)": 190,
            "c3cc": 191,
            "Cc1ccc(": 192,
            "[N+](=O)": 193,
            "CC(=O)": 194,
            "c2cccc": 195,
            "c1cccc(": 196,
            "c1ccc2": 197,
            "CC2)": 198,
            "N1": 199,
            "C(F)": 200,
            "C3": 201,
            "s1": 202,
            "c3ccccc3": 203,
            "C[NH+]": 204,
            "ccc2": 205,
            "CCC1": 206,
            "nc(": 207,
            "Cc1": 208,
            "S(=O)(=O)N": 209,
            "nc1": 210,
            "OCC": 211,
            "C(O)": 212,
            "Cc1cc": 213,
            "CCCCCCCC": 214,
            "N2": 215,
            "c3ccc(": 216,
            "=C": 217,
            "OC(C)": 218,
            "Cc1n": 219,
            "c3)": 220,
            "c1ccccc1)": 221,
            "COC(=O)": 222,
            "c(Cl)": 223,
            "Cl)": 224,
            "C(F)(F)": 225,
            "#N)": 226,
            "c5": 227,
            "(C(=O)[O-])": 228,
            "(CC)": 229,
            "OC(=O)": 230,
            "1)": 231,
            "(O)": 232,
            "CC[NH2+]": 233,
            "cc2": 234,
            "c3ccccc3)": 235,
            "=C(": 236,
            "CCN(": 237,
            ")ccc1": 238,
            "C[NH2+]": 239,
            "O=C(N": 240,
            "F)cc1": 241,
            "(F)(F)F)": 242,
            "nn": 243,
            ")cc2": 244,
            "=N": 245,
            "COc1ccc(": 246,
            "c4ccccc": 247,
            "CS": 248,
            "CC(C)(C)": 249,
            "CCCC1": 250,
            "c(F)": 251,
            "2)CC1": 252,
            "c1cn": 253,
            "CCOC(=O)": 254,
            "CCCN": 255,
            "c2cc(": 256,
            "CCC(C)": 257,
            "CC3)": 258,
            "nc2": 259,
            "NC(=O)N": 260,
            "C(=O)[O-]": 261,
            "C(C)C": 262,
            "=S": 263,
            "c4ccc": 264,
            "CC(O)": 265,
            "o1": 266,
            "CC3": 267,
            "cs": 268,
            "CCCO": 269,
            "2)C1": 270,
            "[N+](=O)[O-])": 271,
            "CCN(C(=O)": 272,
            "(C(C)": 273,
            "CCC2": 274,
            "(Cl)cc1": 275,
            "[N+](=O)[O-]": 276,
            "c1ccc2c(": 277,
            "cn1": 278,
            "C(=O)N1": 279,
            "CC(C": 280,
            "(N)": 281,
            "[S": 282,
            "c2c(": 283,
            "Cn1": 284,
            "=[NH+]": 285,
            "Cc1ccc": 286,
            "CCCCC1": 287,
            "O=C(C": 288,
            "n3": 289,
            "Cc1cc(": 290,
            "c2c1": 291,
            "Cc1ccccc1": 292,
            "ncc": 293,
            "(C2": 294,
            "c2ccc3": 295,
            "O=C([O-])": 296,
            ")cc2)": 297,
            "c1ccc2c(c1)": 298,
            "CC)": 299,
            "c2cn": 300,
            "c(C(=O)N": 301,
            "[Si": 302,
            ")N1": 303,
            "c12": 304,
            "(CC(=O)N": 305,
            "[nH+]": 306,
            "CCC(C": 307,
            "ccc3": 308,
            "c3cccc": 309,
            "CC1)": 310,
            "CNC(=O)": 311,
            "[NH+]1": 312,
            "CC=": 313,
            "[Si]": 314,
            "n(": 315,
            ")cc(": 316,
            "CC(C)C": 317,
            "c1ccc(Cl)cc1": 318,
            "OC1": 319,
            "c2cccc(": 320,
            "[NH+]2": 321,
            "CCn1": 322,
            "c4ccccc4": 323,
            "c2ccc(C": 324,
            "OC2": 325,
            "(C)cc": 326,
            "COc1cc": 327,
            "cccc": 328,
            "c(C)c1": 329,
            "N#": 330,
            "CCNC(=O)": 331,
            "CCC[NH2+]": 332,
            "c1c(": 333,
            "CC2)cc1": 334,
            "c1cccc(C": 335,
            "CCS": 336,
            "c2ccc(Cl)cc": 337,
            "C(=O)[O-])": 338,
            "c2ccc(F)cc": 339,
            "=O)cc1": 340,
            ")cc3)": 341,
            "C2)": 342,
            "COc1ccc(C": 343,
            "n(C)": 344,
            "OC(C": 345,
            "c2)cc1": 346,
            "5)": 347,
            "NC(=O)C(": 348,
            "nc(N": 349,
            "c[nH]": 350,
            "([O-])": 351,
            "c1C": 352,
            "NC(": 353,
            "c(OC)": 354,
            "#N": 355,
            "c1ccc(F)cc1": 356,
            "NS(=O)(=O)": 357,
            "CN1": 358,
            "c(N)": 359,
            "n2)": 360,
            "(C)(=O)": 361,
            "CCCC2": 362,
            "C[NH+]1": 363,
            "O=C1": 364,
            "nc(C": 365,
            "C(C)C)": 366,
            "Cc1ccc(C": 367,
            "c6": 368,
            ")cc3": 369,
            "c1cccc2": 370,
            "Br)cc1": 371,
            "CC2)c1": 372,
            "S(C)(=O)": 373,
            "N(": 374,
            "C1CC1": 375,
            "(C(F)(F)F)": 376,
            "ccc(": 377,
            "CCC(=O)N": 378,
            "c3n": 379,
            "c(NC(=O)": 380,
            "CC[NH+](C": 381,
            "C(N)": 382,
            "(C)C(=O)": 383,
            "CN(": 384,
            "c1cc2": 385,
            "CCN1": 386,
            "C1=O": 387,
            "c3c(": 388,
            "C4": 389,
            "c1ccc(N": 390,
            "c1ccc(C)": 391,
            "c2ccccc21": 392,
            ")cc2)cc1": 393,
            "OC(C)(C)C)": 394,
            "(C(=O)N2": 395,
            "c(Cl)cc": 396,
            "nn1": 397,
            "OC(": 398,
            "[nH]1": 399,
            "OCCO": 400,
            "cc(C": 401,
            "Cc1cccc(": 402,
            "=C2": 403,
            "=S)": 404,
            "CCC[NH+]": 405,
            "nc3": 406,
            "CCCC(": 407,
            "[Si](C)": 408,
            "Br)c1": 409,
            "O1": 410,
            "CCC3": 411,
            "NC(=O)C1": 412,
            "C(F)(F)F)": 413,
            "cc3": 414,
            "(CC(=O)": 415,
            "c4ccc(": 416,
            "OCO": 417,
            "c2)c1": 418,
            "c2ccccc2)cc1": 419,
            "c1cc(C": 420,
            "N1C(=O)": 421,
            "c4ccccc4)": 422,
            "C(C)(C)C": 423,
            "OCC(=O)N": 424,
            "c4)": 425,
            "c2ccc3c(": 426,
            "ncn": 427,
            "n2)cc1": 428,
            "Cc1cn": 429,
            "C3)": 430,
            "Nc1n": 431,
            "n1)": 432,
            "C(C)(C)": 433,
            "n3)": 434,
            "=S)N": 435,
            "CCC(C(=O)N": 436,
            "NC(=O)C2": 437,
            "c5ccccc": 438,
            "COc1ccccc1": 439,
            "(N)=O)": 440,
            "s1)": 441,
            "OCC)": 442,
            "(Cl)c1": 443,
            "ccccc2": 444,
            "c1ccc(Cl)": 445,
            "P(=O)": 446,
            "O)cc1": 447,
            "c2ccc(N": 448,
            "CCc1n": 449,
            "c(Cl)c1": 450,
            "C(N": 451,
            "n(C": 452,
            "2)n1": 453,
            "c2ccc3c(c2)": 454,
            "c(S": 455,
            "c3cc(": 456,
            "C1)": 457,
            "c2s": 458,
            "(F)(F)F)cc": 459,
            "c(F)c1": 460,
            "CCOCC1": 461,
            "C#": 462,
            "CC1(C)": 463,
            "ncc1": 464,
            "c1ccc(C(=O)N": 465,
            "(CCC": 466,
            "ccc1": 467,
            "I)": 468,
            "c(O)": 469,
            "COc1cc(": 470,
            "NC(=O)C(C)": 471,
            "c1=O": 472,
            "CN(C(=O)": 473,
            "3CCCC": 474,
            "Cc1cc(C)": 475,
            "CC[NH+]1": 476,
            "c3ccc(F)cc": 477,
            "N=": 478,
            "N2C(=O)": 479,
            "CC(CC": 480,
            "CC(C)C)": 481,
            "c3ccc4": 482,
            "no": 483,
            "CC4": 484,
            "c2cc3": 485,
            "CC(=O)[O-])": 486,
            "C)cc1": 487,
            "Cc1cccc": 488,
            "s2)": 489,
            "C(=O)NC(": 490,
            "C(F)(F)F": 491,
            "S(C)(=O)=O)": 492,
            "c3ccc(Cl)cc": 493,
            "l)": 494,
            "c1ncc": 495,
            "c2nc(": 496,
            "c2)CC1": 497,
            "(CO)": 498,
            "c4cc": 499,
            "(C)C(C)": 500,
            "CCC(O)": 501,
            "c(C2": 502,
            "C1=": 503,
            "C(=O)N2": 504,
            "C2=O)": 505,
            "CC(=O)N1": 506,
            "sc1": 507,
            "CC([NH3+])": 508,
            "OC)cc1": 509,
            "c(C(=O)": 510,
            "(C)c1": 511,
            "([NH3+])": 512,
            "c1ccc(O": 513,
            "C(=O)N(": 514,
            "=C(N": 515,
            "C=C": 516,
            "c1ccc(C)cc1": 517,
            "c2ncc": 518,
            "CCC(=O)": 519,
            "CN(C)": 520,
            "CCC=": 521,
            "3)cc1": 522,
            "c(=O)[nH]": 523,
            "(C)C)cc1": 524,
            "c1s": 525,
            "c1ccc(NC(=O)": 526,
            "c(C)cc": 527,
            "(F)c1": 528,
            "S(=O)(=O)N2": 529,
            "c1nc(": 530,
            "ccc21": 531,
            "(C#N)": 532,
            "OC3": 533,
            "COC1": 534,
            "OC)c1": 535,
            "CC4)": 536,
            "N(C)": 537,
            "C(C#N)": 538,
            "c2ccccc2)c1": 539,
            "C(C(=O)N": 540,
            "nc(C)": 541,
            "(N": 542,
            "CC(NC(=O)": 543,
            "c1ccc(Br)cc1": 544,
            "CCCC(C)": 545,
            "CCS(=O)(=O)": 546,
            "cs1": 547,
            "C(C)(C)C)": 548,
            "CCCCC2": 549,
            "COC": 550,
            "ccccc3": 551,
            "C1CCCCC1": 552,
            "C([NH3+])": 553,
            "c2cc(Cl)": 554,
            "c3cccc(": 555,
            "c2ccc(Cl)": 556,
            "CCN(CC)": 557,
            "CCCCO": 558,
            "c2cccc(Cl)": 559,
            "N(C": 560,
            "c2ccc(OC": 561,
            "c1ccc(C(=O)": 562,
            "[N+](=O)[O-])cc1": 563,
            "C(CO)": 564,
            "(CC(=O)[O-])": 565,
            "CCOCCO": 566,
            "c1ccc(C2": 567,
            "c3cn": 568,
            "c1cs": 569,
            "c(C(C)": 570,
            "n4": 571,
            "c7": 572,
            "s3)": 573,
            "nc(S": 574,
            "(CCO)": 575,
            "CN(C": 576,
            "OC(C)=O)": 577,
            "CCN(C": 578,
            "c5ccccc5": 579,
            "=C1": 580,
            "CCC)": 581,
            "CCCCCCCCCCCC": 582,
            "CC(C)(C)O": 583,
            "CCCNC(=O)": 584,
            "oc(": 585,
            "c1ccc(F)": 586,
            "CCOCC2)": 587,
            "P(=O)([O-])": 588,
            "c2ccc(Br": 589,
            "(C)C2": 590,
            "c(N2": 591,
            "no1": 592,
            "N(C(=O)": 593,
            "C[NH+](C)": 594,
            "(CCCC": 595,
            "c2ccc(Cl)cc2": 596,
            "c(OC)c1": 597,
            "C(O)C(O)": 598,
            "[nH]c(": 599,
            "c1cc(Cl)cc": 600,
            "O)cc": 601,
            "c3ccc(F)cc3)": 602,
            "CCCn1": 603,
            "c2cccc3": 604,
            "[NH2+]C": 605,
            "C12": 606,
            "c2ccc(C)": 607,
            "c2cc(C)": 608,
            "(c2ccccc2)": 609,
            "CCOC": 610,
            "c(O": 611,
            "OCC1": 612,
            "c(C(=O)[O-])": 613,
            "ccc4": 614,
            "c2ccccc12": 615,
            "[N+](=O)[O-])c1": 616,
            "c3ccc(C": 617,
            "N=C": 618,
            "C2)cc1": 619,
            "n2)c1": 620,
            "O=S(=O)": 621,
            "c2ncn": 622,
            "c[nH+]": 623,
            "o2)": 624,
            "C(=": 625,
            "3CCO": 626,
            "c2C)": 627,
            "c4cccc": 628,
            "c(Br)": 629,
            "CCCN(C(=O)": 630,
            "COc1cc(C": 631,
            "F)ccc1": 632,
            "CCCCC3)": 633,
            "CC[NH+](C)": 634,
            "c2cs": 635,
            "CCOC1": 636,
            "c2cccc(F)": 637,
            "CCCCC2)": 638,
            "nc2)": 639,
            "[n+]": 640,
            "NC(=O)C": 641,
            "c1cccc(Cl)c1": 642,
            "%1": 643,
            "CCC4": 644,
            "CCCC2)": 645,
            "c12)": 646,
            "c2ccc(F)cc2)": 647,
            "C(=O)NC(C": 648,
            "c1ccc(N2": 649,
            "c(C(F)(F)F)": 650,
            "C[NH+]=C(N": 651,
            "c1cccnc1": 652,
            "Cc1cc(C": 653,
            "S(=O)(=O)N1": 654,
            "COc1cccc(": 655,
            "c2ccc(Cl)cc2)": 656,
            "C(=C": 657,
            "CC[NH+](CC": 658,
            "(O": 659,
            "(C(C)(C)C)": 660,
            "c2ccc(F)cc2": 661,
            "CCN(S(=O)(=O)": 662,
            "C1CCCC1": 663,
            "CCC([NH3+])": 664,
            "c2=O)": 665,
            "OC(CO)": 666,
            "c1c(C)": 667,
            "ccccc6": 668,
            "C1O": 669,
            "C(=O)OC": 670,
            "c2cc(F)": 671,
            "=C(N)": 672,
            "CS(=O)(=O)": 673,
            "CC(=O)[O-]": 674,
            "Cc2ccccc2": 675,
            "c1cc(N": 676,
            "c3ccc(Cl)cc3)": 677,
            "N)=O)": 678,
            "CCCN(": 679,
            "c2cc(C": 680,
            "CC(C(=O)N": 681,
            "n2cc": 682,
            "o1)": 683,
            ")cc2)c1": 684,
            "c21": 685,
            "CC[NH+](CC(=O)N": 686,
            "CCc1ccc(": 687,
            "C(C)=O)": 688,
            "[N-]": 689,
            "CCO)": 690,
            "C(NC(=O)": 691,
            "c(C#N)": 692,
            "C(=S)N": 693,
            "c2ccc(C(=O)N": 694,
            "c1N": 695,
            "c1ncn": 696,
            "C1CCCC": 697,
            "c2ccc(O": 698,
            "n2cn": 699,
            "CC(C)O": 700,
            "C=C1": 701,
            "o3)": 702,
            "(C[NH3+])": 703,
            "CCOc1ccc(": 704,
            "OC(C)(C)C": 705,
            "c2ccc(F)": 706,
            "c3ccccc2": 707,
            "C(F)(F)C(F)(F)": 708,
            "C[NH+]2": 709,
            "C2=O)cc1": 710,
            "c2ccccc2)CC1": 711,
            "CCC(NC(=O)": 712,
            "c2ccc(C)cc": 713,
            "Cc1cc2": 714,
            "CCCS": 715,
            "c(cc1": 716,
            "=[NH2+]": 717,
            "CCN(CC": 718,
            "C2CC2)": 719,
            "c1O": 720,
            "CCC(CC)": 721,
            "c1c[nH]": 722,
            "c1cccc(F)c1": 723,
            "CCCCC1)": 724,
            "[nH]c(=O)": 725,
            "c1cccs1": 726,
            "N(C)C(=O)": 727,
            "CC[NH2+]CC1": 728,
            "ncc2": 729,
            ")cccc1": 730,
            "c(OC": 731,
            "co": 732,
            "[N+]([O-])": 733,
            "CCN1C(=O)": 734,
            "(N)(=O)": 735,
            "nnc1": 736,
            "CCc1ccccc1": 737,
            "c3ccc4c(": 738,
            "CO)": 739,
            "Cc1ccc(C)": 740,
            "c6ccccc6": 741,
            "CC1(": 742,
            "c2c(C)": 743,
            "c2)C1": 744,
            "C(C)C(=O)N": 745,
            "s2)cc1": 746,
            "(c1ccccc1)": 747,
            "n1C": 748,
            "CN1C(=O)": 749,
            ")cc4": 750,
            "N3": 751,
            "n2)CC1": 752,
            "CC(O": 753,
            "n(CC": 754,
            "C[NH+](C": 755,
            "C2)c1": 756,
            "nn2": 757,
            "=C(O)": 758,
            "C1CCC": 759,
            "CCNC(N": 760,
            "Cc1cccc(C": 761,
            "[NH+](C)C)": 762,
            "Cc1ccc(NC(=O)": 763,
            "CC([NH2+]": 764,
            "c2n1": 765,
            "OCc1ccccc1": 766,
            "c2)n1": 767,
            "c1ccncc1": 768,
            "Cc1ccc2": 769,
            "3CCOCC3)": 770,
            "c1[nH]": 771,
            "(C(C)(C)C": 772,
            "c2nc3ccccc3": 773,
            "CCCCCCCCCCCCCCCC": 774,
            "c(Br)c1": 775,
            "C#N)": 776,
            "O=[N+]([O-])": 777,
            "Br)ccc1": 778,
            "-2": 779,
            ")cc21": 780,
            "Cc1cs": 781,
            "C(=O)O": 782,
            "(F)F)": 783,
            "C5": 784,
            "Cc1ccc(C(=O)N": 785,
            "(C(=O)[O-]": 786,
            "3)CC1": 787,
            ")cc4)": 788,
            ")cc2)CC1": 789,
            "c(F)cc": 790,
            "C#N": 791,
            "C=C(": 792,
            "c3ccc(C)cc": 793,
            "c(C3": 794,
            "c(F)c(F)": 795,
            "nc12": 796,
            "c1nnc(": 797,
            "c3ccc4c(c3)": 798,
            "(F)(F)F)cc1": 799,
            "c1cc(C)": 800,
            "CCOc1ccccc1": 801,
            "CC(N": 802,
            "CC[NH+](C(C)": 803,
            "c5ccc": 804,
            "n[nH]": 805,
            "o2)cc1": 806,
            "CC2)CC1": 807,
            "(C(C)C)": 808,
            "NC(=S)N": 809,
            "C1(": 810,
            "CCCC(=O)N": 811,
            "CC(C)(C)C": 812,
            "C)c1": 813,
            "c2[nH]": 814,
            "c2ccccc2F)": 815,
            "S(N)(=O)": 816,
            "c1ccc(O)cc1": 817,
            ")C(=O)": 818,
            "c1c(F)cc": 819,
            "CC12": 820,
            "CC#": 821,
            "nc(N)": 822,
            "S1": 823,
            "c2cc(Cl)ccc2": 824,
            "NC(=O)C(C": 825,
            "CCN2": 826,
            "CC2)n1": 827,
            "cc(N": 828,
            "3)c1": 829,
            "CCC(=O)[O-])": 830,
            "COc1ccc2": 831,
            "C1CC": 832,
            "SC": 833,
            "NC(=O)CS": 834,
            "c2cc(Br)": 835,
            "Cl)cc1": 836,
            "c2ccccc2Cl)": 837,
            "c1nc2ccccc2": 838,
            "CCC(C)(C)": 839,
            "=O)cc": 840,
            "c2ccncc": 841,
            "N(CC": 842,
            "nc3)": 843,
            "CN2": 844,
            "CC(=O)O": 845,
            "c2ccccc2)C1": 846,
            "Cc1nc(": 847,
            "CN(C)C(=O)": 848,
            "[NH+]3": 849,
            "C(=O)N(C": 850,
            "C=C(C)": 851,
            "c1c(Cl)cc": 852,
            "CC[NH+](CC)": 853,
            "c1ccc([N+](=O)[O-])cc1": 854,
            "CCC[NH+]1": 855,
            "O)c1": 856,
            "OC(C)(C)": 857,
            "COc1cccc": 858,
            "6)": 859,
            "CC1=": 860,
            "ncn1": 861,
            "NC1": 862,
            "c3ccc(OC": 863,
            "(C(=O)OC)": 864,
            "c1ccccc1)N": 865,
            "c2ccc([N+](=O)[O-]": 866,
            "(C)C)c1": 867,
            "COc1cc2": 868,
            "[NH+](C)": 869,
            "CCN(C(=O)N": 870,
            "C1C": 871,
            "CC[NH+](C(C)C(=O)N": 872,
            "nc2c1": 873,
            "CN(CC": 874,
            "c3ccc(N": 875,
            "sc2c1": 876,
            "c2cc(C(=O)N": 877,
            "OC)c(OC)": 878,
            "CCCC(=O)": 879,
            "c2ccc(NC(=O)": 880,
            "Cc1ccc(N": 881,
            "O[Si](C)": 882,
            "c2c(F)cc": 883,
            "C(N)=O": 884,
            "CC(=": 885,
            "S)": 886,
            "C(C(=O)[O-])": 887,
            "c3s": 888,
            "C(=O)NC1": 889,
            "c1cc(Cl)": 890,
            "CC2)ccc1": 891,
            "c2cc1": 892,
            "3CCCC3)": 893,
            "CCCCC3": 894,
            "c2ccccc12)": 895,
            "c1nc(N": 896,
            "CC=C": 897,
            "CCC(CC": 898,
            "NC(=O)C([NH3+])": 899,
            "COc1ccc(C2": 900,
            "C(CC)": 901,
            "CC(=O)N2": 902,
            "c3ncc": 903,
            "S(C)(=O)=O": 904,
            "cc4": 905,
            "Cn1cc": 906,
            "c4ccc5": 907,
            "CCC(O": 908,
            "CCCCCCCCC": 909,
            "cc(Br)": 910,
            "(C(C)=O)": 911,
            "c2cccs2)": 912,
            "C(N)=O)": 913,
            "c1ccc(OC)cc1": 914,
            "c3C)": 915,
            "c8": 916,
            "c5ccccc5)": 917,
            "Cc1cc(C(=O)N": 918,
            "c2cccnc2": 919,
            "[NH2+]C2": 920,
            "C(=O)C1": 921,
            "CCl)": 922,
            "c4c(": 923,
            "c2cccc(C)": 924,
            "C(F)F)": 925,
            "CCC=CCC=": 926,
            "c1cc(Cl)ccc1": 927,
            "CCCN1": 928,
            "nc1)": 929,
            "ccccc4": 930,
            "C(OC": 931,
            "[NH+](C)C": 932,
            "CC1CCCC": 933,
            "CC[NH+]2": 934,
            "C[NH2+]C1": 935,
            "O=C(NC1": 936,
            "=NNC(=O)": 937,
            "COc1cccc(C": 938,
            "=[NH2+])": 939,
            "Cc1no": 940,
            "c1ccc(Br)": 941,
            "c1ccc2ccccc2": 942,
            "CCC2)": 943,
            "(C)C3": 944,
            "CCN(C)": 945,
            "c3ccc(Cl)cc3": 946,
            "Cc1ccc(F)cc1": 947,
            ")cc(OC)c1": 948,
            "c1ccc(Cl)cc1)": 949,
            "c2cccnc2)": 950,
            "c1ccccc1Cl": 951,
            "c(=O)n1": 952,
            "CCCN1C(=O)": 953,
            "c1ccc(F)cc1)": 954,
            "CCCC3": 955,
            "c1ccc(C(C)": 956,
            ")cc1)": 957,
            "3CCCC3": 958,
            "CCC(N": 959,
            "c3ccc(Cl)": 960,
            "c3cccs3)": 961,
            "sc2": 962,
            "c3cccc(Cl)": 963,
            "c5ccc(": 964,
            "OCC2": 965,
            "C(Cl)": 966,
            "n1cn": 967,
            "c2nnc(": 968,
            "cn2": 969,
            "c1cccc(NC(=O)": 970,
            "(c3ccccc3)": 971,
            "c(=O)n2": 972,
            "CC2)C1": 973,
            "CCC3)": 974,
            "c3cccc4": 975,
            "c1cccc2c1": 976,
            "ccc2c1": 977,
            "nc4": 978,
            "CC1(C)C": 979,
            "c3cc4": 980,
            "CC(C(=O)[O-])": 981,
            "CC1(C": 982,
            "c1ccc2c(c1)OCO": 983,
            "COC(=O)C1": 984,
            "CCOC(=O)C1": 985,
            "Cc1s": 986,
            "c3c2": 987,
            "=C([O-])": 988,
            "c2ccccc2)n1": 989,
            "CCC(C)C": 990,
            "CC(CC(C": 991,
            "Br)cc": 992,
            "c1ccco1": 993,
            "(OC)": 994,
            "NC2": 995,
            "CCOc1cc(C": 996,
            "C(F)F": 997,
            "c4ccc(F)cc": 998,
            "=C(C": 999,
            "c3nn": 1000,
            "(CC2": 1001,
            "CC(C)C1": 1002,
            "c3cc(Cl)": 1003,
            "=C(C)": 1004,
            "c1cc(C(=O)N": 1005,
            "c%1": 1006,
            "n1cc": 1007,
            "c1cc(F)ccc1": 1008,
            "c(C(=O)N2": 1009,
            "CCCC(C": 1010,
            "OCC(C": 1011,
            "3C)": 1012,
            "3)C2": 1013,
            "c1ncccc1": 1014,
            "CC1C": 1015,
            "CCO1": 1016,
            "ccccc12": 1017,
            "3CC3)": 1018,
            "=CC(=O)": 1019,
            "oc1": 1020,
            "c1nc(C": 1021,
            "3)C1": 1022,
            "ccccc7": 1023,
            "C=N": 1024,
            "CCCC)": 1025,
            "CC(F)(F)": 1026,
            "2)C1=O": 1027,
            "c1ccccc1F": 1028,
            "c([N+](=O)[O-])": 1029,
            "CC(C)[NH2+]": 1030,
            "c5)": 1031,
            "n4)": 1032,
            "O2": 1033,
            "OC(C)C)": 1034,
            "C3=O)": 1035,
            "c([O-])": 1036,
            "CCCCC2)cc1": 1037,
            "Cc1ccc(Cl)cc1": 1038,
            "CC(C)(O)": 1039,
            "c2ccco2)": 1040,
            "CCCO1": 1041,
            "c1cc(C)cc": 1042,
            "c2cc(F)ccc2": 1043,
            "CCCCCC1": 1044,
            "c2cc3c(": 1045,
            "c2cccc(C(F)(F)F)": 1046,
            "n2ccc": 1047,
            "OC(C)C": 1048,
            "OCCC": 1049,
            "=C(C#N)": 1050,
            "CC(CO)": 1051,
            "CC(N)=O)": 1052,
            "O=C(CS": 1053,
            "CCOCC1)": 1054,
            "c3cc(C)": 1055,
            "n[nH]1": 1056,
            "C2CCCC": 1057,
            "OP(=O)([O-])": 1058,
            "[NH2+]C)": 1059,
            "c2c[nH]": 1060,
            "CC[NH2+]C1": 1061,
            "4CCCC": 1062,
            "Cc1nn(C)": 1063,
            "CCC(=O)N1": 1064,
            "(NC(=O)": 1065,
            "C(F)(F)F)cc": 1066,
            "c(C)cc(C)": 1067,
            "c([N+](=O)[O-])c1": 1068,
            "c1cc(Br)ccc1": 1069
        },
        "merges": []
    }
}